# Exercise 4.6 Combining & Exporting Data - Second Notebook

This script contains the following points:

1.  Importing the orders_products_combined dataframe
2.  Combining the orders_products_combined dataframe with products data set
3.  Confirming the results of the merge using the merge flag
4.  Exporting newly created dataframe as ords_prods_merge in a suitable format

# 1. Importing libraries and data set

In [2]:
#importing libraries
import pandas as pd
import numpy as np
import os

In [3]:
# assigning path for easier import of data
path = r'C:\Users\magia\06-2025 Instacart Basket Analysis'

In [5]:
# importing new data set using path variable
df_ords = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

# 2. Combining data sets

In [8]:
# importing cleaned products data
df_prod = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [9]:
# checking dimensions of df_prod
df_prod.shape

(49672, 6)

In [10]:
# visualizing first 5 rows of df_prod
df_prod.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [11]:
# visualizing first 5 rows of df_ords
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_between_orders,new_customer,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,0,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [15]:
df_ords.shape

(32434489, 11)

In [13]:
# Drop the existing '_merge' column from previous merger of df_ords to avoid conflict with the new merge indicator column
df_ords = df_ords.drop(columns=['_merge'])

# Inner join on 'product_id' to combine orders with product details,
# adding a new '_merge' column to indicate the source of each row in the merge
df_merged = df_ords.merge(df_prod, on='product_id', how='inner', indicator=True)

In [14]:
# checking dimensions of merged dataframe
df_merged.shape

(32404859, 17)

In [16]:
# visualizing merged dataframe
df_merged.head()

,Unnamed: 0_x,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_between_orders,new_customer,product_id,add_to_cart_order,reordered,Unnamed: 0_y,product_name,aisle_id,department_id,prices,_merge
0,0,2539329,1,1,2,8,NaN,True,196,1,0,195,Soda,77,7,9.0,both
1,0,2539329,1,1,2,8,NaN,True,14084,2,0,14084,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both
2,0,2539329,1,1,2,8,NaN,True,12427,3,0,12427,Original Beef Jerky,23,19,4.4,both
3,0,2539329,1,1,2,8,NaN,True,26088,4,0,26089,Aged White Cheddar Popcorn,23,19,4.7,both
4,0,2539329,1,1,2,8,NaN,True,26405,5,0,26406,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both

In [19]:
# Dropping unnecessary unnamed index columns of both previous dataframes
df_merged = df_merged.drop(columns=['Unnamed: 0_x', 'Unnamed: 0_y'], errors='ignore')

In [21]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_between_orders,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both

In [22]:
#checking new dimensions after column drop
df_merged.shape

(32404859, 15)

# 3. Confirming results with merge flag

In [23]:
# Checking whether we have a full match
df_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

# 4. Exporting merged dataframe as ords_prods_merg in pickle format due its large size

In [24]:
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge.pkl'))